#!/usr/bin/env python
# encoding: utf-8

from rapid.libs.SystemTools import SystemTools

LINE_NODES = {}
LINE_NODES['紅線'] = ['豐原', '潭子', '太原', '台中', '大慶', '烏日', '新烏日', '成功', '彰化']
LINE_NODES['藍線'] = ['臺中火車站', '仁愛醫院', '茄苳腳', '中正國小', '科博館', '忠明國小', '頂何厝', '市政府', '新光/遠百', '秋紅谷', '福安', '中港新城', '澄清醫院', '玉門路', '榮總/東海大學', '東海別墅', '坪頂', '正英路', '弘光科技大學', '晉江寮', '靜宜大學']
LINE_NODES['綠線'] = ['圓山新村', '軍功寮', '頂舊社', '下舊社', '松竹', '二分埔', '文心崇德', '水湳', '文華高中', '櫻花', '市政府', '溝仔墘', '文心公園', '文心五權', '麻茲埔', '大慶', '九張犁', '九德', '烏日', '新烏日', '成功嶺', '成功', '苦苓腳']
LINE_NODES['橘線'] = ['清泉崗機場', '清泉', '埔子墘', '大雅', '港尾', '臺灣塔', '陳平', '水湳', '賴厝', '邱厝','一中商圈', '臺中公園', '臺中火車站', '林祖厝', '中興大學', '東勢尾', '田寮', '大里', '軟體園區', '霧峰', '省諮議會', '亞洲大學', '萬豐', '御史', '草屯', '中興新村', '南崗工業區', '南投高中', '南投縣政府']

class TaichungMetro(SystemTools):
    def __init__(self):
        SystemTools.__init__(self, LINE_NODES)
